In [2]:
import sys
import pandas as pd
import numpy as np

print('python version :' + sys.version)
print('pandas version :' + pd.__version__) # its version is hidden
print('numpy version :' + np.__version__) # its version is hidden

python version :3.6.6 |Anaconda custom (64-bit)| (default, Jun 28 2018, 11:27:44) [MSC v.1900 64 bit (AMD64)]
pandas version :0.23.4
numpy version :1.15.1

In [3]:
filename = r"C:\Users\anshs\00ANSH_PYTHON\04-10-18 [1] NUMPY\PANDAS\new_records.csv"

col_names="emp_id,name,location,age,home_at".split(',')
table = pd.read_csv(filename, header=1,names=col_names)
print(">>>", type(table), '\n>>>\n', table)

>>> <class 'pandas.core.frame.DataFrame'>
>>>
   emp_id               name   location  age    home_at
0  emp12        Naman Arora    Lucknow   18      Delhi
1  emp13         Vikas Jain     Bhopal   18    Gurgaon
2  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon
3  emp15        Priya Singh    Gurgaon   25      Delhi
4  cnt17  Rishab Srivastava     Mumbai   22      Noida
5  emp16      Pravita Singh     Kanpur   21      Delhi
6  tmp18        Naina Gupta    Sonipat   28  New Delhi
7  cnt19         Jai Tiwari  Hyderabad   24      Noida

In [4]:
table['name']='new_value' #will assign 'new_val' to every cell in column 'name'        
print(table)
print()
print()

# will add a new column , along with its values for each column   
table['gender']=list("MFFFMMMF") 
print(table)

  emp_id       name   location  age    home_at
0  emp12  new_value    Lucknow   18      Delhi
1  emp13  new_value     Bhopal   18    Gurgaon
2  emp14  new_value    Gurgaon   21    Gurgaon
3  emp15  new_value    Gurgaon   25      Delhi
4  cnt17  new_value     Mumbai   22      Noida
5  emp16  new_value     Kanpur   21      Delhi
6  tmp18  new_value    Sonipat   28  New Delhi
7  cnt19  new_value  Hyderabad   24      Noida


  emp_id       name   location  age    home_at gender
0  emp12  new_value    Lucknow   18      Delhi      M
1  emp13  new_value     Bhopal   18    Gurgaon      F
2  emp14  new_value    Gurgaon   21    Gurgaon      F
3  emp15  new_value    Gurgaon   25      Delhi      F
4  cnt17  new_value     Mumbai   22      Noida      M
5  emp16  new_value     Kanpur   21      Delhi      M
6  tmp18  new_value    Sonipat   28  New Delhi      M
7  cnt19  new_value  Hyderabad   24      Noida      F

In [5]:
del table['home_at']  # deletes all values of column 'home_at'
print(table)
a = \
    """
    del table[''] is dangerous to use. suppose del table['home_at']
    is used once and somehow print() doesn't work. then we run this 
    code again and now we will get an error saying "column does not exist
    
    a better way is to wrap it around some conditional function like:
        if table.does_column_exist(col_name):
            del table[col_name] 
            print(table)
    does any function like that exists??
    
    """

  emp_id       name   location  age gender
0  emp12  new_value    Lucknow   18      M
1  emp13  new_value     Bhopal   18      F
2  emp14  new_value    Gurgaon   21      F
3  emp15  new_value    Gurgaon   25      F
4  cnt17  new_value     Mumbai   22      M
5  emp16  new_value     Kanpur   21      M
6  tmp18  new_value    Sonipat   28      M
7  cnt19  new_value  Hyderabad   24      F

In [6]:
# how to remove rows???

table=table.drop(table.index[1])
print(table)
#it removes row from a copy of main table. therefore to make changes
#  in original table, you gotta assign it

  emp_id       name   location  age gender
0  emp12  new_value    Lucknow   18      M
2  emp14  new_value    Gurgaon   21      F
3  emp15  new_value    Gurgaon   25      F
4  cnt17  new_value     Mumbai   22      M
5  emp16  new_value     Kanpur   21      M
6  tmp18  new_value    Sonipat   28      M
7  cnt19  new_value  Hyderabad   24      F

In [36]:
# accessing each row:
table_length = len(table)
for i in range(table_length):
    print(">>>\n", type(table.loc[i]), table.loc[i])

#but i think this is wrong for 3 aspects:
#1) table.loc[:] is not defined anywhere
#2) we want data in  a list format, and not in column-value format (series format)
#3) since the indexes we are using are 0,1,2.. in this example, it does not mean ,
#  it will be always the same(remember that pandas is a 2-d datastructure whose both  indexname and column_name can be 
# changed and need not be 0,1,2...

>>>
 <class 'pandas.core.series.Series'> emp_id          emp12
name        new_value
location      Lucknow
age                18
gender              M
Name: 0, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          emp13
name        new_value
location       Bhopal
age                18
gender              F
Name: 1, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          emp14
name        new_value
location      Gurgaon
age                21
gender              F
Name: 2, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          emp15
name        new_value
location      Gurgaon
age                25
gender              F
Name: 3, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          cnt17
name        new_value
location       Mumbai
age                22
gender              M
Name: 4, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          emp16
name        new_value
location       Kanpur
age                21
gender              M
Name: 5, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          tmp18
name        new_value
location      Sonipat
age                28
gender              M
Name: 6, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          cnt19
name        new_value
location    Hyderabad
age                24
gender              F
Name: 7, dtype: object

In [7]:
#adding new row 

#table.loc[-1] = 'emp_-1', 'val_added', 'val_added', 0, 'G'
print(table)
a = \
    '''output(before executing the next statement)
    
        emp_id       name   location  age gender
     0   emp12  new_value    Lucknow   18      M
     1   emp13  new_value     Bhopal   18      F
     2   emp14  new_value    Gurgaon   21      F
     3   emp15  new_value    Gurgaon   25      F
     4   cnt17  new_value     Mumbai   22      M
     5   emp16  new_value     Kanpur   21      M
     6   tmp18  new_value    Sonipat   28      M
     7   cnt19  new_value  Hyderabad   24      F
    -1  emp_-1  val_added  val_added    0      G
    
    '''
#table.index+=1


'''output(before after the next statement)

    emp_id       name   location  age gender
1   emp12  new_value    Lucknow   18      M
2   emp13  new_value     Bhopal   18      F
3   emp14  new_value    Gurgaon   21      F
4   emp15  new_value    Gurgaon   25      F
5   cnt17  new_value     Mumbai   22      M
6   emp16  new_value     Kanpur   21      M
7   tmp18  new_value    Sonipat   28      M
8   cnt19  new_value  Hyderabad   24      F
0  emp_-1  val_added  val_added    0      G

'''

#BUT THIS IS CLEARLY WRONG! THE ORDER GOT DISRUPTED!
# but this guy solves it using the next line -_-
table = table.sort_index()

  emp_id       name   location  age gender
0  emp12  new_value    Lucknow   18      M
2  emp14  new_value    Gurgaon   21      F
3  emp15  new_value    Gurgaon   25      F
4  cnt17  new_value     Mumbai   22      M
5  emp16  new_value     Kanpur   21      M
6  tmp18  new_value    Sonipat   28      M
7  cnt19  new_value  Hyderabad   24      F

In [8]:
#modyfieng the current data,again it surely needs an if clause

table.loc[5] = 'hi'
table.loc[6] = 'this', 'will', 'change', 'full', 'row'
print(table)

  emp_id       name   location   age gender
0  emp12  new_value    Lucknow    18      M
2  emp14  new_value    Gurgaon    21      F
3  emp15  new_value    Gurgaon    25      F
4  cnt17  new_value     Mumbai    22      M
5     hi         hi         hi    hi     hi
6   this       will     change  full    row
7  cnt19  new_value  Hyderabad    24      F

In [69]:
print('>>>',table.__len__(),'\n',table)
table.index=list('abcdefg')
print('>>>\n',table)

>>> 7
    emp_id       name   location   age gender
1  emp_-1  val_added  val_added     0      G
2   emp14  new_value    Gurgaon    21      F
3   emp15  new_value    Gurgaon    25      F
4      hi         hi         hi    hi     hi
5    this       will     change  full    row
6   tmp18  new_value    Sonipat    28      M
7   cnt19  new_value  Hyderabad    24      F
>>>
    emp_id       name   location   age gender
a  emp_-1  val_added  val_added     0      G
b   emp14  new_value    Gurgaon    21      F
c   emp15  new_value    Gurgaon    25      F
d      hi         hi         hi    hi     hi
e    this       will     change  full    row
f   tmp18  new_value    Sonipat    28      M
g   cnt19  new_value  Hyderabad    24      F

In [70]:
table.reset_index()  #doesn't work, ideally it should revert to default index
print('>>>\n', table)

#but table.rset_index() works in this example::
a = \
    """
    suppose we have data like this :
    
     emp_id               name   location   age    home_at  spec_number
    0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6  emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    7  tmp18        Naina Gupta    Sonipat   28  New Delhi         0.00
    8  cnt19         Jai Tiwari  Hyderabad   24      Noida        -2.25
    0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6  emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    7  tmp18        Naina Gupta    Sonipat   28  New Delhi         0.00
    8  cnt19         Jai Tiwari  Hyderabad   24      Noida        -2.25
    0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6  emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    7  tmp18        Naina Gupta    Sonipat   28  New Delhi         0.00
    8  cnt19         Jai Tiwari  Hyderabad   24      Noida        -2.25
    0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6  emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    
    data.resetindex() will add current indexs as 0th column to your data 
    and replace it by new indeses. i.e,
    
         index emp_id            name   location    age    home_at   spec_number             
    0       0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    1       1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2       2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3       3  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4       4  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5       5  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6       6  emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    7       7  tmp18        Naina Gupta    Sonipat   28  New Delhi         0.00
    8       8  cnt19         Jai Tiwari  Hyderabad   24      Noida        -2.25
    9       0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    10      1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    11      2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    ...
    
    
    if we don't want that, we can simply write : 
    data=data.reset_index(drop=True)
    
       emp_id               name   location  age    home_at  spec_number
    0   emp11       Aakash Kumar      Patna   22      Noida         0.00
    1   emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2   emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3   emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4   emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5   cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6   emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    7   tmp18        Naina Gupta    Sonipat   28  New Delhi         0.00
    8   cnt19         Jai Tiwari  Hyderabad   24      Noida        -2.25
    9   emp11       Aakash Kumar      Patna   22      Noida         0.00
    10  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    11  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    12  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    13  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    14  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    """

>>>
    emp_id       name   location   age gender
a  emp_-1  val_added  val_added     0      G
b   emp14  new_value    Gurgaon    21      F
c   emp15  new_value    Gurgaon    25      F
d      hi         hi         hi    hi     hi
e    this       will     change  full    row
f   tmp18  new_value    Sonipat    28      M
g   cnt19  new_value  Hyderabad    24      F

In [1]:
table['koo']='aah'

NameError: name 'table' is not defined

In [78]:
print(table)

   emp_id       name   location   age gender     k  koo
a  emp_-1  val_added  val_added     0      G  meow  aah
b   emp14  new_value    Gurgaon    21      F  meow  aah
c   emp15  new_value    Gurgaon    25      F  meow  aah
d      hi         hi         hi    hi     hi  meow  aah
e    this       will     change  full    row  meow  aah
f   tmp18  new_value    Sonipat    28      M  meow  aah
g   cnt19  new_value  Hyderabad    24      F  meow  aah

In [79]:
del table['koo']
print(table)

   emp_id       name   location   age gender     k
a  emp_-1  val_added  val_added     0      G  meow
b   emp14  new_value    Gurgaon    21      F  meow
c   emp15  new_value    Gurgaon    25      F  meow
d      hi         hi         hi    hi     hi  meow
e    this       will     change  full    row  meow
f   tmp18  new_value    Sonipat    28      M  meow
g   cnt19  new_value  Hyderabad    24      F  meow